stm32duino/STM32LoRaWAN/src/STM32LoRaWAN.cpp
/**
  ******************************************************************************
  * @file    STM32LoRaWAN.cpp
  * @author  Matthijs Kooijman
  * @brief   Main implementation for the STM32LoRaWAN library.
  *
  * API based on the MKRWAN / MKRWAN_v2 library.
  *
  ******************************************************************************
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * Revised BSD License - https://spdx.org/licenses/BSD-3-Clause.html
  *
  * Redistribution and use in source and binary forms, with or without
  * modification, are permitted provided that the following conditions
  * are met:
  *
  *     1. Redistributions of source code must retain the above copyright notice,
  *        this list of conditions and the following disclaimer.
  *     2. Redistributions in binary form must reproduce the above copyright
  *        notice, this list of conditions and the following disclaimer in the
  *        documentation and/or other materials provided with the distribution.
  *     3. Neither the name of the copyright holder nor the names of its
  *        contributors may be used to endorse or promote products derived from this
  *        software without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
  * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
  * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  */

#include "STM32LoRaWAN.h"
#include "STM32CubeWL/LoRaWAN/Mac/LoRaMacTest.h"
#include <core_debug.h>

// The MKRWAN API has no constants for datarates, so just accepts 0 for
// DR0. The STM32CubeWL API uses DR_x constants, but they contain just
// the plain value, so no translation is needed. However, do doublecheck
// that this is really the case.
#if DR_0 != 0 || DR_1 != 1 || DR_2 != 2 || DR_3 != 3 || DR_4 != 4 || DR_5 != 5 || DR_6 != 6 || DR_8 != 8 || DR_9 != 9 || DR_10 != 10 || DR_11 != 11 || DR_12 != 12 || DR_13 != 13 || DR_14 != 14 || DR_15 != 15
#error "Unexpected datarate constants"
#endif

// Same for tx power
#if TX_POWER_0 != 0 || TX_POWER_1 != 1 || TX_POWER_2 != 2 || TX_POWER_3 != 3 || TX_POWER_4 != 4 || TX_POWER_5 != 5 || TX_POWER_6 != 6 || TX_POWER_8 != 8 || TX_POWER_9 != 9 || TX_POWER_10 != 10 || TX_POWER_11 != 11 || TX_POWER_12 != 12 || TX_POWER_13 != 13 || TX_POWER_14 != 14 || TX_POWER_15 != 15
#error "Unexpected txpower constants"
#endif

/* Get the RTC object for init */
STM32RTC& _rtc = STM32RTC::getInstance();

STM32LoRaWAN* STM32LoRaWAN::instance;

bool STM32LoRaWAN::begin(_lora_band band)
{
  if (instance != nullptr)
    return failure("Only one STM32LoRaWAN instance can be used");
  instance = this;

  /*
   * Init RTC as an object :
   * use the MIX mode = free running BCD calendar + binary mode for
   * the sub-second counter RTC_SSR on 32 bit
    */
  _rtc.setClockSource(STM32RTC::LSE_CLOCK);
  _rtc.setBinaryMode(STM32RTC::MODE_MIX);
  _rtc.begin(true, STM32RTC::HOUR_24);
  /* Attach the callback function before enabling Interrupt */
  _rtc.attachInterrupt(UTIL_TIMER_IRQ_MAP_PROCESS, STM32RTC::ALARM_B);
  /* The subsecond alarm B is set during the StartTimerEvent */

  UTIL_TIMER_Init(_rtc.getHandle());

  LoRaMacStatus_t res = LoRaMacInitialization(&LoRaMacPrimitives, &LoRaMacCallbacks, (LoRaMacRegion_t)band);
  if (res != LORAMAC_STATUS_OK) {
    return failure("LoRaMacInitialization failed: %s\r\n", toString(res));
  }

  res = LoRaMacStart();
  if (res != LORAMAC_STATUS_OK)
    return failure("LoRaMacStart failed: %s\r\n", toString(res));

  /*
   * Default datarate for joining and data transmission (until ADR
   * changes it, if enabled). This defaults to DR 4 since that is the
   * fastest/highest (least spectrum usage) DR that is supported by all
   * regions. If this DR has insufficient range, the join process (and
   * ADR) will fall back to lower datarates automatically.
   */
  if (!dataRate(DR_4))
    return false;

  /*
   * Enable ADR by default, to be more friendly with the spectrum and to
   * match the default value of MKRWAN / mkrwan1300-fw */
  if (!setADR(true))
    return false;

  /*
   * Default to the builtin devEUI for this chip.
   * There is also a mechanism of passing a GetUniqueId callback to
   * LoRaMacIniitalization so it initialize the secure element with that
   * default, but just setting the devEUI explicitly here is easier.
   */
  if (!setDevEui(builtinDevEUI()))
    return false;

  return true;
}

void STM32LoRaWAN::MacProcessNotify()
{
  // Called by the stack from an ISR when there is work to do
  instance->mac_process_pending = true;
  if (instance->maintain_needed_callback)
    instance->maintain_needed_callback();
}

uint8_t STM32LoRaWAN::GetBatteryLevel()
{
  // Called by the stack from an ISR when there is a DevStatusReq
  uint8_t battery_level = BAT_LEVEL_NO_MEASURE;
  if (instance->battery_level_callback) {
      battery_level = instance->battery_level_callback();
  }

  return battery_level;
}

void STM32LoRaWAN::maintain()
{
  if (mac_process_pending) {
    mac_process_pending = false;
    LoRaMacProcess( );
  }
}

void STM32LoRaWAN::maintainUntilIdle()
{
  do {
    maintain();
  } while(busy());
}

bool STM32LoRaWAN::continuousWave(uint32_t frequency, int8_t powerdBm,
                                  uint16_t timeout) {
  MlmeReq_t mlmeReq;
  mlmeReq.Type = MLME_TXCW_1;
  mlmeReq.Req.TxCw.Frequency = frequency;
  mlmeReq.Req.TxCw.Power = powerdBm;
  mlmeReq.Req.TxCw.Timeout = timeout;
  LoRaMacStatus_t res = LoRaMacMlmeRequest(&mlmeReq);
  if (res != LORAMAC_STATUS_OK)
    return failure("Failed to enable CW mode: %s\r\n", toString(res));

