stm32duino/STM32LoRaWAN/src/STM32LoRaWAN.cpp
  return true;
}

bool STM32LoRaWAN::joinOTAAAsync()
{
  clear_rx();
  this->fcnt_up = 0;
  this->fcnt_down = 0;

  MlmeReq_t mlmeReq;
  mlmeReq.Type = MLME_JOIN;
  // Just use the most recently configured datarate for join
  mlmeReq.Req.Join.Datarate = getDataRate();
  mlmeReq.Req.Join.NetworkActivation = ACTIVATION_TYPE_OTAA;

  // Starts the OTAA join procedure
  LoRaMacStatus_t res = LoRaMacMlmeRequest(&mlmeReq);
  if (res != LORAMAC_STATUS_OK)
    return failure("Join request failed: %s\r\n", toString(res));

  return true;
}

bool STM32LoRaWAN::joinOTAA() {
  unsigned long start = millis();

  do {
    // TODO: Should this decrease datarate after a few failed attempts?
    // MKRWAN has an older version of LoRaMAC-node that handles this
    // in a region-dependent way (usually decreasing datarate every
    // 8 attempts). Our newer version of LoRaMAC-node just uses the
    // configured datarate, except for some regions (US915/AU915/AS923)
    // where the regional parameters prescribe what datarate to use for
    // joins.
    // See https://github.com/Lora-net/LoRaMac-node/commit/bec887dd2414b091fe62277ed57d0166f77a5055
    // for the change in LoRaMAC-node.
    //
    // With a timeout of only 60s, increasing the DR only every
    // 8 attempts is probably not helpful, so maybe more often? Or maybe
    // leave it to the sketch to increase DR every batch of 60s? Note
    // that we (or the sketch) can probably freely just increase the DR
    // without worrying about region-specific limits, since if we go
    // outside regional DR limits, the stack will just refuse to set the
    // DR.
    // Or maybe use PHY_NEXT_LOWER_TX_DR
    joinOTAAAsync();

    // TODO: Should this cancel a pending join attempt if the timeout
    // runs out?
    maintainUntilIdle();
  } while (!connected() && (millis() - start < DEFAULT_JOIN_TIMEOUT));

  return connected();
}


bool STM32LoRaWAN::joinABP() {
  clear_rx();
  MibRequestConfirm_t mibReq;
  mibReq.Param.NetworkActivation = ACTIVATION_TYPE_ABP;
  if (!mibSet("MIB_NETWORK_ACTIVATION", MIB_NETWORK_ACTIVATION, mibReq))
    return false;

  return true;
}

bool STM32LoRaWAN::dataRate(uint8_t dr) {
  return mibSetInt8("dataRate", MIB_CHANNELS_DATARATE, dr);
}

int STM32LoRaWAN::getDataRate() {
  int8_t dr;
  if (!mibGetInt8("dataRate", MIB_CHANNELS_DATARATE, &dr))
    return -1;
  return dr;
}

bool STM32LoRaWAN::power(uint8_t index){
  return mibSetInt8("power", MIB_CHANNELS_TX_POWER, index);
}

bool STM32LoRaWAN::powerdB(int8_t db){
  // This uses knowledge about the radio implementation to calculate the
  // index to use. See RegionCommonComputeTxPower()
  int8_t index = -(db - 1) / 2;
  return mibSetInt8("power", MIB_CHANNELS_TX_POWER, index);
}

bool STM32LoRaWAN::dutyCycle(bool on){
  LoRaMacTestSetDutyCycleOn(on);
  return true;
}

bool STM32LoRaWAN::setPort(uint8_t port){
  this->tx_port = port;
  return true;
}

uint8_t STM32LoRaWAN::getPort(){
  return this->tx_port;
}


/* TODO: Changing band requires complete reinitialization. How to do
 * that reliably?
bool STM32LoRaWAN::configureBand(_lora_band band){
}
*/

bool STM32LoRaWAN::publicNetwork(bool publicNetwork){
  return mibSetBool("publicNetwork", MIB_PUBLIC_NETWORK, publicNetwork);
}


bool STM32LoRaWAN::setADR(bool adr){
  return mibSetBool("ADR", MIB_ADR, adr);
}

int STM32LoRaWAN::getADR(){
  bool res;
  if (!mibGetBool("ADR", MIB_ADR, &res))
    return -1;
  return res;
}

// MKRWAN_v2 version
int STM32LoRaWAN::getrxfreq(){
  return getRX2Freq();
}

int STM32LoRaWAN::getRX2DR(){
  RxChannelParams_t rx;
  if (!mibGetRxChannelParams("RX2DR", MIB_RX2_CHANNEL, &rx))
      return -1;
  return rx.Datarate;
}

bool STM32LoRaWAN::setRX2DR(uint8_t dr){
  // MIB_RX2_CHANNEL contains multiple values, so do get-modify-set
  RxChannelParams_t rx;
  if (!mibGetRxChannelParams("RX2DR", MIB_RX2_CHANNEL, &rx))
      return false;
  rx.Datarate = dr;
  return mibSetRxChannelParams("RX2DR", MIB_RX2_CHANNEL, rx);
}

uint32_t STM32LoRaWAN::getRX2Freq(){
  RxChannelParams_t rx;
  if (!mibGetRxChannelParams("RX2Freq", MIB_RX2_CHANNEL, &rx))
      return -1;
  return rx.Frequency;
}

bool STM32LoRaWAN::setRX2Freq(uint32_t freq){
  // MIB_RX2_CHANNEL contains multiple values, so do get-modify-set
  RxChannelParams_t rx;
  if (!mibGetRxChannelParams("RX2Freq", MIB_RX2_CHANNEL, &rx))
      return false;
  rx.Frequency = freq;
  return mibSetRxChannelParams("RX2Freq", MIB_RX2_CHANNEL, rx);
}

/* TODO: Implement frame counters setting
 *
 * STM32CubeWL does not seem to have an obvious interface to access
 * these. They are stored by LoRaMacCrypto.c, but the functions to set
 * and query the last values are static (the only non-static one is to
 * complete a 16-bit framecounter with the upper bits).
 *
 * Maybe we can set them through the NVM interface somehow?
bool STM32LoRaWAN::setFCU(uint16_t fcu){
}

bool STM32LoRaWAN::setFCD(uint16_t fcd){
}
*/

int32_t STM32LoRaWAN::getFCU(){
  return this->fcnt_up;
}

int32_t STM32LoRaWAN::getFCD(){
  return this->fcnt_down;
}

bool STM32LoRaWAN::enableChannel(unsigned idx) {
  return modifyChannelEnabled(idx, true);
}

bool STM32LoRaWAN::disableChannel(unsigned idx) {
  return modifyChannelEnabled(idx, false);
}

bool STM32LoRaWAN::modifyChannelEnabled(unsigned idx, bool value) {
  const char *enabledisable = value ? "enable" : "disable";
  if (idx >= REGION_NVM_MAX_NB_CHANNELS)
    return failure("Cannot %s channel %u, only %u channels are available\r\n", enabledisable, idx, REGION_NVM_MAX_NB_CHANNELS);

  ChannelParams_t *channels;
  if (!mibGetPtr("Channels", MIB_CHANNELS, (void**)&channels))
    return false;

  if (channels[idx].Frequency == 0)
    return failure("Cannot %s channel %u, channel not defined\r\n", enabledisable, idx);

  uint16_t new_mask[REGION_NVM_CHANNELS_MASK_SIZE];
  uint16_t* cur_mask;
  if (!mibGetPtr("ChannelsMask", MIB_CHANNELS_MASK, (void**)&cur_mask))
    return false;

  // Ensure the channel mask can hold all channels, so the check against
  // REGION_NVM_MAX_NB_CHANNELS above is sufficient to prevent overflows here.
  static_assert(REGION_NVM_CHANNELS_MASK_SIZE * 16 <= REGION_NVM_MAX_NB_CHANNELS, "Mask too short for all channels?");

  memcpy(new_mask, cur_mask, sizeof(new_mask));
  if (value)
    new_mask[idx / 16] |= 1 << (idx % 16);
  else
    new_mask[idx / 16] &= ~(1 << (idx % 16));

  return mibSetPtr("ChannelsMask", MIB_CHANNELS_MASK, (void*)new_mask);
}

bool STM32LoRaWAN::isChannelEnabled(unsigned idx){
  if (idx >= REGION_NVM_MAX_NB_CHANNELS)
    return false;

