stm32duino/STM32LoRaWAN/src/STM32LoRaWAN.cpp
  ChannelParams_t *channels;
  if (!mibGetPtr("Channels", MIB_CHANNELS, (void**)&channels))
    return false;

  // Treat unconfigured channels as disabled (even though the enabled
  // mask defaults to being set).
  if (channels[idx].Frequency == 0)
    return 0;

  uint16_t* cur_mask;
  if (!mibGetPtr("ChannelsMask", MIB_CHANNELS_MASK, (void**)&cur_mask))
    return false;

  // Ensure the channel mask can hold all channels, so the check against
  // REGION_NVM_MAX_NB_CHANNELS above is sufficient to prevent overflows here.
  static_assert(REGION_NVM_CHANNELS_MASK_SIZE * 16 <= REGION_NVM_MAX_NB_CHANNELS, "Mask too short for all channels?");

  return cur_mask[idx / 16] & (1 << (idx % 16));
}

bool STM32LoRaWAN::send(const uint8_t *payload, size_t size, bool confirmed) {
  McpsReq_t mcpsReq;

  if (confirmed) {
    mcpsReq.Type = MCPS_CONFIRMED;
    // When ADR is used, the datarate passed here is ignored. If not,
    // just pass the current rate, which should be the most recently
    // configured one..
    mcpsReq.Req.Confirmed.Datarate = getDataRate();
    mcpsReq.Req.Confirmed.fPort = this->tx_port;
    mcpsReq.Req.Confirmed.fBufferSize = size;
    mcpsReq.Req.Confirmed.fBuffer = const_cast<uint8_t*>(payload);
    #if (defined( LORAMAC_VERSION ) && ( LORAMAC_VERSION == 0x01000300 ))
    // Mimic the 1.0.4 behavior where the application manages retransmissions.
    // See https://github.com/Lora-net/LoRaMac-node/discussions/1096
    mcpsReq.Req.Confirmed.NbTrials = 1;
    #endif /* LORAMAC_VERSION */
  } else {
    mcpsReq.Type = MCPS_UNCONFIRMED;
    // See comment about datarate above
    mcpsReq.Req.Unconfirmed.Datarate = getDataRate();
    mcpsReq.Req.Unconfirmed.fPort = this->tx_port;
    mcpsReq.Req.Unconfirmed.fBufferSize = size;
    mcpsReq.Req.Unconfirmed.fBuffer = const_cast<uint8_t*>(payload);
  }

  LoRaMacTxInfo_t txInfo;
  if( LoRaMacQueryTxPossible( size, &txInfo ) == LORAMAC_STATUS_LENGTH_ERROR ) {
    if (size > txInfo.CurrentPossiblePayloadSize)
      return failure("Packet too long, only %u bytes of payload supported at current datarate\r\n", txInfo.CurrentPossiblePayloadSize);

    // If the packet would fit, but is still rejected, this means there
    // are pending MAC commands that do not fit in the header along with
    // the payload, or do not fit in the header at all (i.e. require an
    // empty uplink). Schedule an uplink to flush these commands.
    mcpsReq.Type = MCPS_UNCONFIRMED;
    mcpsReq.Req.Unconfirmed.fBuffer = NULL;
    mcpsReq.Req.Unconfirmed.fBufferSize = 0;
    LoRaMacMcpsRequest(&mcpsReq, /* allowDelayedTx */ true);

    return failure("Cannot send packet, wait for pending MAC commands to be sent\r\n");
  }

  LoRaMacStatus_t res = LoRaMacMcpsRequest(&mcpsReq, /* allowDelayedTx */ true);
  if (res != LORAMAC_STATUS_OK)
    return failure("Failed to send packet: %s\r\n", toString(res));

  // TODO: Report mcpsReq.ReqReturn.DutyCycleWaitTime somewhere?
  return true;
}

// All these MIB get and set functions have quite a bit of boilerplate,
// but at least they make their callers a lot less verbose.
bool STM32LoRaWAN::mibGet(const char* name, Mib_t type, MibRequestConfirm_t& mibReq) {
  mibReq.Type = type;
  LoRaMacStatus_t res = LoRaMacMibGetRequestConfirm(&mibReq);
  if (res != LORAMAC_STATUS_OK)
    return failure("Failed to get %s: %s\r\n", name, toString(res));

  return true;
}

bool STM32LoRaWAN::mibSet(const char* name, Mib_t type, MibRequestConfirm_t& mibReq) {
  mibReq.Type = type;
  LoRaMacStatus_t res = LoRaMacMibSetRequestConfirm(&mibReq);
  if (res != LORAMAC_STATUS_OK)
    return failure("Failed to set %s: %s\r\n", name, toString(res));

  return true;
}

bool STM32LoRaWAN::mibGetBool(const char* name, Mib_t type, bool *value) {
  MibRequestConfirm_t mibReq;
  if (!mibGet(name, type, mibReq))
    return false;

  switch(type) {
    case MIB_ADR: *value = mibReq.Param.AdrEnable; break;
    case MIB_PUBLIC_NETWORK: *value = mibReq.Param.EnablePublicNetwork; break;
    case MIB_REPEATER_SUPPORT: *value = mibReq.Param.EnableRepeaterSupport; break;
    default: return failure("Internal error: Unknown MIB type: %s / %u\r\n", name, type);
  }
  return true;
}

bool STM32LoRaWAN::mibSetBool(const char* name, Mib_t type, bool value) {
  MibRequestConfirm_t mibReq;
  switch(type) {
    case MIB_ADR: mibReq.Param.AdrEnable = value; break;
    case MIB_PUBLIC_NETWORK: mibReq.Param.EnablePublicNetwork = value; break;
    case MIB_REPEATER_SUPPORT: mibReq.Param.EnableRepeaterSupport = value; break;
    default: return failure("Internal error: Unknown MIB type: %s / %u\r\n", name, type);
  }

  return mibSet(name, type, mibReq);
}

bool STM32LoRaWAN::mibGetUint8(const char* name, Mib_t type, uint8_t *value) {
  MibRequestConfirm_t mibReq;
  if (!mibGet(name, type, mibReq))
    return false;

  switch(type) {
    case MIB_CHANNELS_NB_TRANS: *value = mibReq.Param.ChannelsNbTrans; break;
    case MIB_MIN_RX_SYMBOLS: *value = mibReq.Param.MinRxSymbols; break;
    default: return failure("Internal error: Unknown MIB type: %s / %u\r\n", name, type);
  }
  return true;
}

bool STM32LoRaWAN::mibSetUint8(const char* name, Mib_t type, uint8_t value) {
  MibRequestConfirm_t mibReq;
  switch(type) {
    case MIB_CHANNELS_NB_TRANS: mibReq.Param.ChannelsNbTrans = value; break;
    case MIB_MIN_RX_SYMBOLS: mibReq.Param.MinRxSymbols = value; break;
    default: return failure("Internal error: Unknown MIB type: %s / %u\r\n", name, type);
  }

  return mibSet(name, type, mibReq);
}

bool STM32LoRaWAN::mibGetInt8(const char* name, Mib_t type, int8_t *value) {
  MibRequestConfirm_t mibReq;
  if (!mibGet(name, type, mibReq))
    return false;

  switch(type) {
    #if (defined( LORAMAC_VERSION ) && ( LORAMAC_VERSION == 0x01000400 ))
    case MIB_CHANNELS_MIN_TX_DATARATE: *value = mibReq.Param.ChannelsMinTxDatarate; break;
    #endif /* LORAMAC_VERSION */
    case MIB_CHANNELS_DEFAULT_DATARATE: *value = mibReq.Param.ChannelsDefaultDatarate; break;
    case MIB_CHANNELS_DATARATE: *value = mibReq.Param.ChannelsDatarate; break;
    case MIB_CHANNELS_DEFAULT_TX_POWER: *value = mibReq.Param.ChannelsDefaultTxPower; break;
    case MIB_CHANNELS_TX_POWER: *value = mibReq.Param.ChannelsTxPower; break;
    case MIB_PING_SLOT_DATARATE: *value = mibReq.Param.PingSlotDatarate; break;
    default: return failure("Internal error: Unknown MIB type: %s / %u\r\n", name, type);
  }
  return true;
}

