stm32duino/STM32LoRaWAN/src/STM32LoRaWAN.cpp
bool STM32LoRaWAN::mibSetInt8(const char* name, Mib_t type, int8_t value) {
  MibRequestConfirm_t mibReq;
  switch(type) {
    #if (defined( LORAMAC_VERSION ) && ( LORAMAC_VERSION == 0x01000400 ))
    case MIB_CHANNELS_MIN_TX_DATARATE: mibReq.Param.ChannelsMinTxDatarate = value; break;
    #endif /* LORAMAC_VERSION */
    case MIB_CHANNELS_DEFAULT_DATARATE: mibReq.Param.ChannelsDefaultDatarate = value; break;
    case MIB_CHANNELS_DATARATE: mibReq.Param.ChannelsDatarate = value; break;
    case MIB_CHANNELS_DEFAULT_TX_POWER: mibReq.Param.ChannelsDefaultTxPower = value; break;
    case MIB_CHANNELS_TX_POWER: mibReq.Param.ChannelsTxPower = value; break;
    case MIB_PING_SLOT_DATARATE: mibReq.Param.PingSlotDatarate = value; break;
    default: return failure("Internal error: Unknown MIB type: %s / %u\r\n", name, type);
  }

  return mibSet(name, type, mibReq);
}

bool STM32LoRaWAN::mibGetUint32(const char* name, Mib_t type, uint32_t *value) {
  MibRequestConfirm_t mibReq;
  if (!mibGet(name, type, mibReq))
    return false;

  switch(type) {
    case MIB_NET_ID: *value = mibReq.Param.NetID; break;
    case MIB_DEV_ADDR: *value = mibReq.Param.DevAddr; break;
    case MIB_MAX_RX_WINDOW_DURATION: *value = mibReq.Param.MaxRxWindow; break;
    case MIB_RECEIVE_DELAY_1: *value = mibReq.Param.ReceiveDelay1; break;
    case MIB_RECEIVE_DELAY_2: *value = mibReq.Param.ReceiveDelay2; break;
    case MIB_JOIN_ACCEPT_DELAY_1: *value = mibReq.Param.JoinAcceptDelay1; break;
    case MIB_JOIN_ACCEPT_DELAY_2: *value = mibReq.Param.JoinAcceptDelay2; break;
    case MIB_SYSTEM_MAX_RX_ERROR: *value = mibReq.Param.SystemMaxRxError; break;
    case MIB_BEACON_INTERVAL: *value = mibReq.Param.BeaconInterval; break;
    case MIB_BEACON_RESERVED: *value = mibReq.Param.BeaconReserved; break;
    case MIB_BEACON_GUARD: *value = mibReq.Param.BeaconGuard; break;
    case MIB_BEACON_WINDOW: *value = mibReq.Param.BeaconWindow; break;
    case MIB_BEACON_WINDOW_SLOTS: *value = mibReq.Param.BeaconWindowSlots; break;
    case MIB_PING_SLOT_WINDOW: *value = mibReq.Param.PingSlotWindow; break;
    case MIB_BEACON_SYMBOL_TO_DEFAULT: *value = mibReq.Param.BeaconSymbolToDefault; break;
    case MIB_BEACON_SYMBOL_TO_EXPANSION_MAX: *value = mibReq.Param.BeaconSymbolToExpansionMax; break;
    case MIB_PING_SLOT_SYMBOL_TO_EXPANSION_MAX: *value = mibReq.Param.PingSlotSymbolToExpansionMax; break;
    case MIB_BEACON_SYMBOL_TO_EXPANSION_FACTOR: *value = mibReq.Param.BeaconSymbolToExpansionFactor; break;
    case MIB_PING_SLOT_SYMBOL_TO_EXPANSION_FACTOR: *value = mibReq.Param.PingSlotSymbolToExpansionFactor; break;
    case MIB_MAX_BEACON_LESS_PERIOD: *value = mibReq.Param.MaxBeaconLessPeriod; break;
    case MIB_RXB_C_TIMEOUT: *value = mibReq.Param.RxBCTimeout; break;
    default: return failure("Internal error: Unknown MIB type: %s / %u\r\n", name, type);
  }
  return true;
}

bool STM32LoRaWAN::mibSetUint32(const char* name, Mib_t type, uint32_t value) {
  MibRequestConfirm_t mibReq;
  switch(type) {
    case MIB_NET_ID: mibReq.Param.NetID = value; break;
    case MIB_DEV_ADDR: mibReq.Param.DevAddr = value; break;
    case MIB_MAX_RX_WINDOW_DURATION: mibReq.Param.MaxRxWindow = value; break;
    case MIB_RECEIVE_DELAY_1: mibReq.Param.ReceiveDelay1 = value; break;
    case MIB_RECEIVE_DELAY_2: mibReq.Param.ReceiveDelay2 = value; break;
    case MIB_JOIN_ACCEPT_DELAY_1: mibReq.Param.JoinAcceptDelay1 = value; break;
    case MIB_JOIN_ACCEPT_DELAY_2: mibReq.Param.JoinAcceptDelay2 = value; break;
    case MIB_SYSTEM_MAX_RX_ERROR: mibReq.Param.SystemMaxRxError = value; break;
    case MIB_BEACON_INTERVAL: mibReq.Param.BeaconInterval = value; break;
    case MIB_BEACON_RESERVED: mibReq.Param.BeaconReserved = value; break;
    case MIB_BEACON_GUARD: mibReq.Param.BeaconGuard = value; break;
    case MIB_BEACON_WINDOW: mibReq.Param.BeaconWindow = value; break;
    case MIB_BEACON_WINDOW_SLOTS: mibReq.Param.BeaconWindowSlots = value; break;
    case MIB_PING_SLOT_WINDOW: mibReq.Param.PingSlotWindow = value; break;
    case MIB_BEACON_SYMBOL_TO_DEFAULT: mibReq.Param.BeaconSymbolToDefault = value; break;
    case MIB_BEACON_SYMBOL_TO_EXPANSION_MAX: mibReq.Param.BeaconSymbolToExpansionMax = value; break;
    case MIB_PING_SLOT_SYMBOL_TO_EXPANSION_MAX: mibReq.Param.PingSlotSymbolToExpansionMax = value; break;
    case MIB_BEACON_SYMBOL_TO_EXPANSION_FACTOR: mibReq.Param.BeaconSymbolToExpansionFactor = value; break;
    case MIB_PING_SLOT_SYMBOL_TO_EXPANSION_FACTOR: mibReq.Param.PingSlotSymbolToExpansionFactor = value; break;
    case MIB_MAX_BEACON_LESS_PERIOD: mibReq.Param.MaxBeaconLessPeriod = value; break;
    case MIB_RXB_C_TIMEOUT: mibReq.Param.RxBCTimeout = value; break;
    default: return failure("Internal error: Unknown MIB type: %s / %u\r\n", name, type);
  }

  return mibSet(name, type, mibReq);
}

bool STM32LoRaWAN::mibGetUint64(const char* name, Mib_t type, uint64_t *value) {
  MibRequestConfirm_t mibReq;
  uint8_t buf[8];

  switch(type) {
    case MIB_DEV_EUI: mibReq.Param.DevEui = buf; break;
    case MIB_JOIN_EUI: mibReq.Param.JoinEui = buf; break;
    default: return failure("Internal error: Unknown MIB type: %s / %u\r\n", name, type);
  }
  if (!mibGet(name, type, mibReq))
    return false;
  *value = (uint64_t)buf[0] << 7*8 |
           (uint64_t)buf[1] << 6*8 |
           (uint64_t)buf[2] << 5*8 |
           (uint64_t)buf[3] << 4*8 |
           (uint64_t)buf[4] << 3*8 |
           (uint64_t)buf[5] << 2*8 |
           (uint64_t)buf[6] << 1*8 |
           (uint64_t)buf[7] << 0*8;

  return true;
}

bool STM32LoRaWAN::mibSetUint64(const char* name, Mib_t type, uint64_t value) {
  MibRequestConfirm_t mibReq;
  uint8_t buf[8] = {
    (uint8_t)(value >> 7*8),
    (uint8_t)(value >> 6*8),
    (uint8_t)(value >> 5*8),
    (uint8_t)(value >> 4*8),
    (uint8_t)(value >> 3*8),
    (uint8_t)(value >> 2*8),
    (uint8_t)(value >> 1*8),
    (uint8_t)(value >> 0*8),
  };

  switch(type) {
    case MIB_DEV_EUI: mibReq.Param.DevEui = buf; break;
    case MIB_JOIN_EUI: mibReq.Param.JoinEui = buf; break;
    default: return failure("Internal error: Unknown MIB type: %s / %u\r\n", name, type);
  }

  return mibSet(name, type, mibReq);
}

size_t STM32LoRaWAN::mibHexSize(const char *name, Mib_t type) {
  switch(type) {
    case MIB_DEV_EUI:
    case MIB_JOIN_EUI:
      return SE_EUI_SIZE;

