stm32duino/STM32LoRaWAN/src/STM32LoRaWAN.cpp
    case MIB_DEV_ADDR:
      return sizeof(MibRequestConfirm_t::Param.DevAddr);

    case MIB_APP_KEY:
    case MIB_NWK_KEY:
    #if (defined( LORAMAC_VERSION ) && ( LORAMAC_VERSION == 0x01010100 ))
    case MIB_J_S_INT_KEY:
    case MIB_J_S_ENC_KEY:
    case MIB_F_NWK_S_INT_KEY:
    case MIB_S_NWK_S_INT_KEY:
    case MIB_NWK_S_ENC_KEY:
    #else /* ( LORAMAC_VERSION == 0x01010100 ) */
    case MIB_NWK_S_KEY:
    #endif /* ( LORAMAC_VERSION == 0x01010100 ) */
    case MIB_APP_S_KEY:
    case MIB_MC_KE_KEY:
    #if ( LORAMAC_MAX_MC_CTX > 0 )
    case MIB_MC_KEY_0:
    case MIB_MC_APP_S_KEY_0:
    case MIB_MC_NWK_S_KEY_0:
    #endif /* LORAMAC_MAX_MC_CTX > 0 */
    #if ( LORAMAC_MAX_MC_CTX > 1 )
    case MIB_MC_KEY_1:
    case MIB_MC_APP_S_KEY_1:
    case MIB_MC_NWK_S_KEY_1:
    #endif /* LORAMAC_MAX_MC_CTX > 1 */
    #if ( LORAMAC_MAX_MC_CTX > 2 )
    case MIB_MC_KEY_2:
    case MIB_MC_APP_S_KEY_2:
    case MIB_MC_NWK_S_KEY_2:
    #endif /* LORAMAC_MAX_MC_CTX > 2 */
    #if ( LORAMAC_MAX_MC_CTX > 3 )
    case MIB_MC_KEY_3:
    case MIB_MC_APP_S_KEY_3:
    case MIB_MC_NWK_S_KEY_3:
    #endif /* LORAMAC_MAX_MC_CTX > 3 */
      return SE_KEY_SIZE;

    default:
      return failure("Internal error: Unknown MIB type: %s / %u\r\n", name, type);
  }
}

bool STM32LoRaWAN::mibGetHex(const char* name, Mib_t type, String* value) {
  MibRequestConfirm_t mibReq;
  size_t size = mibHexSize(name, type);

  if (!size)
    return false;

  uint8_t dev_addr_buf[4];
  uint8_t buf_type[size];
  uint8_t *buf = buf_type;

  switch(type) {
    case MIB_DEV_EUI: mibReq.Param.DevEui = buf_type; break;
    case MIB_JOIN_EUI: mibReq.Param.JoinEui = buf_type; break;
     case MIB_APP_KEY: mibReq.Param.AppKey = buf_type; break;
    case MIB_NWK_KEY: mibReq.Param.NwkKey = buf_type; break;
    #if (defined( LORAMAC_VERSION ) && ( LORAMAC_VERSION == 0x01010100 ))
    case MIB_J_S_INT_KEY: mibReq.Param.JSIntKey = buf_type; break;
    case MIB_J_S_ENC_KEY: mibReq.Param.JSEncKey = buf_type; break;
    case MIB_F_NWK_S_INT_KEY: mibReq.Param.FNwkSIntKey = buf_type; break;
    case MIB_S_NWK_S_INT_KEY: mibReq.Param.SNwkSIntKey = buf_type; break;
    case MIB_NWK_S_ENC_KEY: mibReq.Param.NwkSEncKey = buf_type; break;
    #else /* ( LORAMAC_VERSION == 0x01010100 ) */
    case MIB_NWK_S_KEY: mibReq.Param.NwkSKey = buf_type; break;
    #endif /* ( LORAMAC_VERSION == 0x01010100 ) */
    case MIB_APP_S_KEY: mibReq.Param.AppSKey = buf_type; break;
    case MIB_MC_KE_KEY: mibReq.Param.McKEKey = buf_type; break;
    #if ( LORAMAC_MAX_MC_CTX > 0 )
    case MIB_MC_KEY_0: mibReq.Param.McKey0 = buf_type; break;
    case MIB_MC_APP_S_KEY_0: mibReq.Param.McAppSKey0 = buf_type; break;
    case MIB_MC_NWK_S_KEY_0: mibReq.Param.McNwkSKey0 = buf_type; break;
    #endif /* LORAMAC_MAX_MC_CTX > 0 */
    #if ( LORAMAC_MAX_MC_CTX > 1 )
    case MIB_MC_KEY_1: mibReq.Param.McKey1 = buf_type; break;
    case MIB_MC_APP_S_KEY_1: mibReq.Param.McAppSKey1 = buf_type; break;
    case MIB_MC_NWK_S_KEY_1: mibReq.Param.McNwkSKey1 = buf_type; break;
    #endif /* LORAMAC_MAX_MC_CTX > 1 */
    #if ( LORAMAC_MAX_MC_CTX > 2 )
    case MIB_MC_KEY_2: mibReq.Param.McKey2 = buf_type; break;
    case MIB_MC_APP_S_KEY_2: mibReq.Param.McAppSKey2 = buf_type; break;
    case MIB_MC_NWK_S_KEY_2: mibReq.Param.McNwkSKey2 = buf_type; break;
    #endif /* LORAMAC_MAX_MC_CTX > 2 */
    #if ( LORAMAC_MAX_MC_CTX > 3 )
    case MIB_MC_KEY_3: mibReq.Param.McKey3 = buf_type; break;
    case MIB_MC_APP_S_KEY_3: mibReq.Param.McAppSKey3 = buf_type; break;
    case MIB_MC_NWK_S_KEY_3: mibReq.Param.McNwkSKey3 = buf_type; break;
    #endif /* LORAMAC_MAX_MC_CTX > 3 */
    default:
      return failure("Internal error: Unknown MIB type: %s / %u\r\n", name, type);
  }


  if (!mibGet(name, type, mibReq))
    return false;

  if (type == MIB_DEV_ADDR) {
    // This assumes big endian, since that's the natural way to
    // write down a a number in hex
    dev_addr_buf[0] = mibReq.Param.DevAddr >> (3*8);
    dev_addr_buf[1] = mibReq.Param.DevAddr >> (2*8);
    dev_addr_buf[2] = mibReq.Param.DevAddr >> (1*8);
    dev_addr_buf[3] = mibReq.Param.DevAddr >> (0*8);
    buf = dev_addr_buf;
  }

  return toHex(value, buf, size);
}

bool STM32LoRaWAN::mibSetHex(const char* name, Mib_t type, const char* value) {
  // The buffer-passing API is a bit fragile, since the size of the
  // buffer to be passed is implicit, and also not very well
  // documented. So we need to derive the size here.
  size_t size = mibHexSize(name, type);

  if (!size)
    return false;

  uint8_t buf[size];
  if (!parseHex(buf, value, size))
    return false;

  MibRequestConfirm_t mibReq;
  switch(type) {
    case MIB_DEV_EUI: mibReq.Param.DevEui = buf; break;
    case MIB_JOIN_EUI: mibReq.Param.JoinEui = buf; break;
    // This assumes big endian, since that's the natural way to
    // write down a a number in hex
    case MIB_DEV_ADDR: mibReq.Param.DevAddr = makeUint32(buf[0], buf[1], buf[2], buf[3]); break;
    case MIB_APP_KEY: mibReq.Param.AppKey = buf; break;
    case MIB_NWK_KEY: mibReq.Param.NwkKey = buf; break;
    #if (defined( LORAMAC_VERSION ) && ( LORAMAC_VERSION == 0x01010100 ))
    case MIB_J_S_INT_KEY: mibReq.Param.JSIntKey = buf; break;
    case MIB_J_S_ENC_KEY: mibReq.Param.JSEncKey = buf; break;
    case MIB_F_NWK_S_INT_KEY: mibReq.Param.FNwkSIntKey = buf; break;
    case MIB_S_NWK_S_INT_KEY: mibReq.Param.SNwkSIntKey = buf; break;
    case MIB_NWK_S_ENC_KEY: mibReq.Param.NwkSEncKey = buf; break;
    #else /* ( LORAMAC_VERSION == 0x01010100 ) */
    case MIB_NWK_S_KEY: mibReq.Param.NwkSKey = buf; break;
    #endif /* ( LORAMAC_VERSION == 0x01010100 ) */
    case MIB_APP_S_KEY: mibReq.Param.AppSKey = buf; break;
    case MIB_MC_KE_KEY: mibReq.Param.McKEKey = buf; break;
    #if ( LORAMAC_MAX_MC_CTX > 0 )
    case MIB_MC_KEY_0: mibReq.Param.McKey0 = buf; break;
    case MIB_MC_APP_S_KEY_0: mibReq.Param.McAppSKey0 = buf; break;
    case MIB_MC_NWK_S_KEY_0: mibReq.Param.McNwkSKey0 = buf; break;
    #endif /* LORAMAC_MAX_MC_CTX > 0 */
    #if ( LORAMAC_MAX_MC_CTX > 1 )
    case MIB_MC_KEY_1: mibReq.Param.McKey1 = buf; break;
    case MIB_MC_APP_S_KEY_1: mibReq.Param.McAppSKey1 = buf; break;
    case MIB_MC_NWK_S_KEY_1: mibReq.Param.McNwkSKey1 = buf; break;
    #endif /* LORAMAC_MAX_MC_CTX > 1 */
    #if ( LORAMAC_MAX_MC_CTX > 2 )
    case MIB_MC_KEY_2: mibReq.Param.McKey2 = buf; break;
    case MIB_MC_APP_S_KEY_2: mibReq.Param.McAppSKey2 = buf; break;
    case MIB_MC_NWK_S_KEY_2: mibReq.Param.McNwkSKey2 = buf; break;
    #endif /* LORAMAC_MAX_MC_CTX > 2 */
    #if ( LORAMAC_MAX_MC_CTX > 3 )
    case MIB_MC_KEY_3: mibReq.Param.McKey3 = buf; break;
    case MIB_MC_APP_S_KEY_3: mibReq.Param.McAppSKey3 = buf; break;
    case MIB_MC_NWK_S_KEY_3: mibReq.Param.McNwkSKey3 = buf; break;
    #endif /* LORAMAC_MAX_MC_CTX > 3 */
    default:
      return failure("Internal error: Unknown MIB type: %s / %u\r\n", name, type);
  }

  return mibSet(name, type, mibReq);
}

bool STM32LoRaWAN::mibGetRxChannelParams(const char* name, Mib_t type, RxChannelParams_t *value) {
  MibRequestConfirm_t mibReq;
  if (!mibGet(name, type, mibReq))
    return false;

  switch(type) {
    case MIB_RX2_CHANNEL: *value = mibReq.Param.Rx2Channel; break;
    case MIB_RX2_DEFAULT_CHANNEL: *value = mibReq.Param.Rx2DefaultChannel; break;
    case MIB_RXC_CHANNEL: *value = mibReq.Param.RxCChannel; break;
    case MIB_RXC_DEFAULT_CHANNEL: *value = mibReq.Param.RxCDefaultChannel; break;
    default: return failure("Internal error: Unknown MIB type: %s / %u\r\n", name, type);
  }
  return true;
}

