stm32duino/STM32LoRaWAN/src/STM32LoRaWAN.cpp
bool STM32LoRaWAN::mibSetRxChannelParams(const char* name, Mib_t type, RxChannelParams_t value) {
  MibRequestConfirm_t mibReq;
  switch(type) {
    case MIB_RX2_CHANNEL: mibReq.Param.Rx2Channel = value; break;
    case MIB_RX2_DEFAULT_CHANNEL: mibReq.Param.Rx2DefaultChannel = value; break;
    case MIB_RXC_CHANNEL: mibReq.Param.RxCChannel = value; break;
    case MIB_RXC_DEFAULT_CHANNEL: mibReq.Param.RxCDefaultChannel = value; break;
    default: return failure("Internal error: Unknown MIB type: %s / %u\r\n", name, type);
  }

  return mibSet(name, type, mibReq);
}

bool STM32LoRaWAN::mibGetPtr(const char* name, Mib_t type, void **value) {
  MibRequestConfirm_t mibReq;
  if (!mibGet(name, type, mibReq))
    return false;

  switch(type) {
    case MIB_CHANNELS: *value = mibReq.Param.ChannelList; break;
    case MIB_CHANNELS_MASK: *value = mibReq.Param.ChannelsMask; break;
    case MIB_CHANNELS_DEFAULT_MASK: *value = mibReq.Param.ChannelsDefaultMask; break;
    default: return failure("Internal error: Unknown MIB type: %s / %u\r\n", name, type);
  }
  return true;
}

bool STM32LoRaWAN::mibSetPtr(const char* name, Mib_t type, void *value) {
  MibRequestConfirm_t mibReq;
  switch(type) {
    case MIB_CHANNELS: mibReq.Param.ChannelList = (ChannelParams_t*)value; break;
    case MIB_CHANNELS_MASK: mibReq.Param.ChannelsMask = (uint16_t*)value; break;
    case MIB_CHANNELS_DEFAULT_MASK: mibReq.Param.ChannelsDefaultMask = (uint16_t*)value; break;
    default: return failure("Internal error: Unknown MIB type: %s / %u\r\n", name, type);
  }

  return mibSet(name, type, mibReq);
}

/* These MIB types do not have easy getter/setters defined for them yet
 * (but since these were regexed together from LoRaMacInterfaces already, these
 * are left here to maybe put into use in the future.

      case MIB_MULTICAST_CHANNEL: mibReq.Param.MulticastChannel = value; break;
      case MIB_ANTENNA_GAIN: mibReq.Param.AntennaGain = value; break;
      case MIB_DEFAULT_ANTENNA_GAIN: mibReq.Param.DefaultAntennaGain = value; break;
      case MIB_NVM_CTXS: mibReq.Param.Contexts = value; break;
      case MIB_NVM_CTXS: mibReq.Param.BackupContexts = value; break;
      case MIB_ABP_LORAWAN_VERSION: mibReq.Param.AbpLrWanVersion = value; break;
      case MIB_IS_CERT_FPORT_ON: mibReq.Param.IsCertPortOn = value; break;
      case MIB_BEACON_STATE: mibReq.Param.BeaconState = value; break;

      case MIB_MULTICAST_CHANNEL: *value = mibReq.Param.MulticastChannel; break;
      case MIB_ANTENNA_GAIN: *value = mibReq.Param.AntennaGain; break;
      case MIB_DEFAULT_ANTENNA_GAIN: *value = mibReq.Param.DefaultAntennaGain; break;
      case MIB_NVM_CTXS: *value = mibReq.Param.Contexts; break;
      case MIB_NVM_CTXS: *value = mibReq.Param.BackupContexts; break;
      case MIB_ABP_LORAWAN_VERSION: *value = mibReq.Param.AbpLrWanVersion; break;
      case MIB_IS_CERT_FPORT_ON: *value = mibReq.Param.IsCertPortOn; break;
      case MIB_BEACON_STATE: *value = mibReq.Param.BeaconState; break;
*/

bool STM32LoRaWAN::connected() {
  MibRequestConfirm_t mibReq;
  return mibGet("MIB_NETWORK_ACTIVATION", MIB_NETWORK_ACTIVATION, mibReq)
         && (mibReq.Param.NetworkActivation != ACTIVATION_TYPE_NONE);
}

bool STM32LoRaWAN::busy() {
  return LoRaMacIsBusy();
}

String STM32LoRaWAN::deviceEUI() {
  String res;
  // Do not check for error, a message will have been generated and the
  // return String will remain invalid to signal the error
  getDevEui(&res);
  return res;
}

const char *STM32LoRaWAN::toString(LoRaMacStatus_t status) {
  switch (status) {
    case LORAMAC_STATUS_OK:
      return "LORAMAC_STATUS_OK";
    case LORAMAC_STATUS_BUSY:
      return "LORAMAC_STATUS_BUSY";
    case LORAMAC_STATUS_SERVICE_UNKNOWN:
      return "LORAMAC_STATUS_SERVICE_UNKNOWN";
    case LORAMAC_STATUS_PARAMETER_INVALID:
      return "LORAMAC_STATUS_PARAMETER_INVALID";
    case LORAMAC_STATUS_FREQUENCY_INVALID:
      return "LORAMAC_STATUS_FREQUENCY_INVALID";
    case LORAMAC_STATUS_DATARATE_INVALID:
      return "LORAMAC_STATUS_DATARATE_INVALID";
    case LORAMAC_STATUS_FREQ_AND_DR_INVALID:
      return "LORAMAC_STATUS_FREQ_AND_DR_INVALID";
    case LORAMAC_STATUS_NO_NETWORK_JOINED:
      return "LORAMAC_STATUS_NO_NETWORK_JOINED";
    case LORAMAC_STATUS_LENGTH_ERROR:
      return "LORAMAC_STATUS_LENGTH_ERROR";
    case LORAMAC_STATUS_REGION_NOT_SUPPORTED:
      return "LORAMAC_STATUS_REGION_NOT_SUPPORTED";
    case LORAMAC_STATUS_SKIPPED_APP_DATA:
      return "LORAMAC_STATUS_SKIPPED_APP_DATA";
    case LORAMAC_STATUS_DUTYCYCLE_RESTRICTED:
      return "LORAMAC_STATUS_DUTYCYCLE_RESTRICTED";
    case LORAMAC_STATUS_NO_CHANNEL_FOUND:
      return "LORAMAC_STATUS_NO_CHANNEL_FOUND";
    case LORAMAC_STATUS_NO_FREE_CHANNEL_FOUND:
      return "LORAMAC_STATUS_NO_FREE_CHANNEL_FOUND";
    case LORAMAC_STATUS_BUSY_BEACON_RESERVED_TIME:
      return "LORAMAC_STATUS_BUSY_BEACON_RESERVED_TIME";
    case LORAMAC_STATUS_BUSY_PING_SLOT_WINDOW_TIME:
      return "LORAMAC_STATUS_BUSY_PING_SLOT_WINDOW_TIME";
    case LORAMAC_STATUS_BUSY_UPLINK_COLLISION:
      return "LORAMAC_STATUS_BUSY_UPLINK_COLLISION";
    case LORAMAC_STATUS_CRYPTO_ERROR:
      return "LORAMAC_STATUS_CRYPTO_ERROR";
    case LORAMAC_STATUS_FCNT_HANDLER_ERROR:
      return "LORAMAC_STATUS_FCNT_HANDLER_ERROR";
    case LORAMAC_STATUS_MAC_COMMAD_ERROR:
      return "LORAMAC_STATUS_MAC_COMMAD_ERROR";
    case LORAMAC_STATUS_CLASS_B_ERROR:
      return "LORAMAC_STATUS_CLASS_B_ERROR";
    case LORAMAC_STATUS_CONFIRM_QUEUE_ERROR:
      return "LORAMAC_STATUS_CONFIRM_QUEUE_ERROR";
    case LORAMAC_STATUS_MC_GROUP_UNDEFINED:
      return "LORAMAC_STATUS_MC_GROUP_UNDEFINED";
    case LORAMAC_STATUS_NVM_DATA_INCONSISTENT:
      return "LORAMAC_STATUS_NVM_DATA_INCONSISTENT";
    case LORAMAC_STATUS_ERROR:
      return "LORAMAC_STATUS_ERROR";
    default:
      return "<unknown>";
  }
}

const char *STM32LoRaWAN::toString(LoRaMacEventInfoStatus_t status) {
  switch(status) {
    case LORAMAC_EVENT_INFO_STATUS_OK:
      return "LORAMAC_EVENT_INFO_STATUS_OK";
    case LORAMAC_EVENT_INFO_STATUS_ERROR:
      return "LORAMAC_EVENT_INFO_STATUS_ERROR";
    case LORAMAC_EVENT_INFO_STATUS_TX_TIMEOUT:
      return "LORAMAC_EVENT_INFO_STATUS_TX_TIMEOUT";
    case LORAMAC_EVENT_INFO_STATUS_RX1_TIMEOUT:
      return "LORAMAC_EVENT_INFO_STATUS_RX1_TIMEOUT";
    case LORAMAC_EVENT_INFO_STATUS_RX2_TIMEOUT:
      return "LORAMAC_EVENT_INFO_STATUS_RX2_TIMEOUT";
    case LORAMAC_EVENT_INFO_STATUS_RX1_ERROR:
      return "LORAMAC_EVENT_INFO_STATUS_RX1_ERROR";
    case LORAMAC_EVENT_INFO_STATUS_RX2_ERROR:
      return "LORAMAC_EVENT_INFO_STATUS_RX2_ERROR";
    case LORAMAC_EVENT_INFO_STATUS_JOIN_FAIL:
      return "LORAMAC_EVENT_INFO_STATUS_JOIN_FAIL";
    case LORAMAC_EVENT_INFO_STATUS_DOWNLINK_REPEATED:
      return "LORAMAC_EVENT_INFO_STATUS_DOWNLINK_REPEATED";
    case LORAMAC_EVENT_INFO_STATUS_TX_DR_PAYLOAD_SIZE_ERROR:
      return "LORAMAC_EVENT_INFO_STATUS_TX_DR_PAYLOAD_SIZE_ERROR";
    #if (defined( LORAMAC_VERSION ) && ( LORAMAC_VERSION == 0x01000300 ))
    case LORAMAC_EVENT_INFO_STATUS_DOWNLINK_TOO_MANY_FRAMES_LOSS:
      return "LORAMAC_EVENT_INFO_STATUS_DOWNLINK_TOO_MANY_FRAMES_LOSS";
    #endif /* LORAMAC_VERSION */
    case LORAMAC_EVENT_INFO_STATUS_ADDRESS_FAIL:
      return "LORAMAC_EVENT_INFO_STATUS_ADDRESS_FAIL";
    case LORAMAC_EVENT_INFO_STATUS_MIC_FAIL:
      return "LORAMAC_EVENT_INFO_STATUS_MIC_FAIL";
    case LORAMAC_EVENT_INFO_STATUS_MULTICAST_FAIL:
      return "LORAMAC_EVENT_INFO_STATUS_MULTICAST_FAIL";
    case LORAMAC_EVENT_INFO_STATUS_BEACON_LOCKED:
      return "LORAMAC_EVENT_INFO_STATUS_BEACON_LOCKED";
    case LORAMAC_EVENT_INFO_STATUS_BEACON_LOST:
      return "LORAMAC_EVENT_INFO_STATUS_BEACON_LOST";
    case LORAMAC_EVENT_INFO_STATUS_BEACON_NOT_FOUND:
      return "LORAMAC_EVENT_INFO_STATUS_BEACON_NOT_FOUND";
    default:
      return "<unknown>";
  }
}

const char *STM32LoRaWAN::toString(Mlme_t mlme) {
  switch(mlme) {
    case MLME_UNKNOWN:
      return "MLME_UNKNOWN";
    case MLME_JOIN:
      return "MLME_JOIN";
    case MLME_REJOIN_0:
      return "MLME_REJOIN_0";
    case MLME_REJOIN_1:
      return "MLME_REJOIN_1";
    case MLME_REJOIN_2:
      return "MLME_REJOIN_2";
    case MLME_LINK_CHECK:
      return "MLME_LINK_CHECK";
    case MLME_TXCW:
      return "MLME_TXCW";
    #if (defined( LORAMAC_VERSION ) && ( LORAMAC_VERSION == 0x01000300 ))
    case MLME_TXCW_1:
      return "MLME_TXCW_1";
    #endif /* LORAMAC_VERSION */
    case MLME_DERIVE_MC_KE_KEY:
      return "MLME_DERIVE_MC_KE_KEY";
    case MLME_DERIVE_MC_KEY_PAIR:
      return "MLME_DERIVE_MC_KEY_PAIR";
    case MLME_DEVICE_TIME:
      return "MLME_DEVICE_TIME";
    case MLME_BEACON:
      return "MLME_BEACON";
    case MLME_BEACON_ACQUISITION:
      return "MLME_BEACON_ACQUISITION";
    case MLME_PING_SLOT_INFO:
      return "MLME_PING_SLOT_INFO";
    case MLME_BEACON_TIMING:
      return "MLME_BEACON_TIMING";
    case MLME_BEACON_LOST:
      return "MLME_BEACON_LOST";
    case MLME_REVERT_JOIN:
      return "MLME_REVERT_JOIN";
    default:
      return "<unknown>";
  }
}

