stm32duino/STM32LoRaWAN/src/STM32LoRaWAN.cpp
const char *STM32LoRaWAN::toString(Mcps_t mcps) {
  switch(mcps) {
    case MCPS_UNCONFIRMED:
      return "MCPS_UNCONFIRMED";
    case MCPS_CONFIRMED:
      return "MCPS_CONFIRMED";
    case MCPS_MULTICAST:
      return "MCPS_MULTICAST";
    case MCPS_PROPRIETARY:
      return "MCPS_PROPRIETARY";
    default:
      return "<unknown>";
  }
}

uint8_t STM32LoRaWAN::parseHex(char c) {
  return (c >= 'A') ? (c >= 'a') ? (c - 'a' + 10) : (c - 'A' + 10) : (c - '0');
}


bool STM32LoRaWAN::parseHex(uint8_t *dest, const char *hex, size_t dest_len) {
  uint8_t *end = dest + dest_len;;
  const char *next = hex;
  while (dest != end) {
    if (next[0] == '\0' || next[1] == '\0') {
      MW_LOG(TS_ON, VLEVEL_M, "Hex string too short, needed %u bytes (%u digits), got: %s\r\n", dest_len, dest_len * 2, hex);
      return false;
    }
    uint8_t high = parseHex(*next++);
    uint8_t low = parseHex(*next++);

    if (high > 16 || low > 16) {
      MW_LOG(TS_ON, VLEVEL_M, "Non-hex digit found in hex string %s\r\n", hex);
      return false;
    }
    *dest++ = high << 4 | low;
  }

  if (next[0] != '\0') {
    MW_LOG(TS_ON, VLEVEL_M, "Hex string too long, needed %u bytes (%u digits), got: %s\r\n", dest_len, dest_len * 2, hex);
    return false;
  }
  return true;
}

char STM32LoRaWAN::toHex(uint8_t b) {
  return (b < 0xa) ? '0' + b : 'A' + (b - 0xa);
}

bool STM32LoRaWAN::toHex(String *dest, const uint8_t *src, size_t src_len) {
  if (!dest->reserve(src_len * 2))
    return failure("Failed to allocate string for hex output");

  *dest = "";
  while (src_len--) {
    dest->concat(toHex(*src >> 4));
    dest->concat(toHex(*src & 0x0f));
    ++src;
  }

  return true;
}

bool STM32LoRaWAN::failure(const char* fmt, ...) {
  va_list ap;
  va_start(ap, fmt);
  vcore_debug(fmt, ap);
  va_end(ap);
  return false;
}

void STM32LoRaWAN::beginPacket() {
  tx_ptr = &tx_buf[0];
}

int STM32LoRaWAN::endPacketAsync(bool confirmed) {
  size_t len = tx_ptr - tx_buf;
  // MKRWAN has more error codes, but those are fairly
  // arbitrary and undocumented, so just return -1 for any error.
  if (!send(tx_buf, len, confirmed))
    return -1;
  return len;
}

int STM32LoRaWAN::endPacket(bool confirmed) {
  size_t res = endPacketAsync(confirmed);

  maintainUntilIdle();

  if (confirmed && !lastAck())
    return -1;

  return res;
}

size_t STM32LoRaWAN::write(uint8_t c) {
  if (tx_ptr == &tx_buf[sizeof(tx_buf)])
    return 0;
  *tx_ptr++ = c;
  return 1;
}

size_t STM32LoRaWAN::write(const uint8_t *buffer, size_t size) {
  size_t room = &tx_buf[sizeof(tx_buf)] - tx_ptr;
  if (size > room)
    size = room;
  memcpy(tx_ptr, buffer, size);
  tx_ptr += size;
  return size;
}

int STM32LoRaWAN::availableForWrite() {
  LoRaMacTxInfo_t txInfo;
  size_t avail = 0;

  if( LoRaMacQueryTxPossible( 0, &txInfo ) == LORAMAC_STATUS_OK ) {
    size_t written = tx_ptr - tx_buf;
    size_t max_payload = txInfo.MaxPossibleApplicationDataSize;
    if (max_payload > sizeof(tx_buf))
      max_payload = sizeof(tx_buf);

    if (max_payload > written)
      avail = max_payload - written;
  }
  return avail;
}

int STM32LoRaWAN::read(uint8_t *buf, size_t size) {
  size_t avail = available();
  if (size > avail)
    size = avail;

  memcpy(buf, rx_ptr, size);
  rx_ptr += size;

  return size;
}

int STM32LoRaWAN::available() {
  return rx_buf + sizeof(rx_buf) - rx_ptr;
}

int STM32LoRaWAN::read() {
  if (rx_ptr >= rx_buf + sizeof(rx_buf))
    return -1;
  return *rx_ptr++;
}

int STM32LoRaWAN::peek() {
  if (rx_ptr >= rx_buf + sizeof(rx_buf))
    return -1;
  return *rx_ptr;
}

int STM32LoRaWAN::parsePacket() {
  // This is what MKRWAN and MKRWAN_v2 also do
  return available();
}

void STM32LoRaWAN::add_rx(const uint8_t *buf, size_t len) {
  size_t room = rx_ptr - rx_buf;
  if (len > room) {
    failure("RX buffer overflow (%u > %u)", len, room);
    len = room;
  }

  size_t avail = available();
  if (available()) {
    // There is still data in the buffer, so we have to move that out of
    // the way (but keep it available at what will be the start of the
    // buffer).
    // Note that this could have been more efficient with a circular
    // buffer, but since this really a corner case that should not occur
    // normally, this extra copy is preferred over the extra complexity
    // of a circular buffer.
    memmove(rx_ptr - len, rx_ptr, avail);
  }
  memcpy(rx_buf + sizeof(rx_buf) - len, buf, len);
  // By modifying rather than setting rx_ptr, this is also correct when
  // we moved old data
  rx_ptr -= len;;
}

uint64_t STM32LoRaWAN::builtinDevEUI() {
  return (uint64_t)LL_FLASH_GetSTCompanyID() << (5*8) | (uint64_t)LL_FLASH_GetDeviceID() << (4*8) | (uint64_t)LL_FLASH_GetUDN();
}

void STM32LoRaWAN::MacMcpsConfirm(McpsConfirm_t* c) {
  // Called after an Mcps request (data TX) when the stack becomes idle again (so after RX windows)
  core_debug(
    "McpsConfirm: req=%s, status=%s, datarate=%u, power=%d, ack=%u, %s=%u, airtime=%u, upcnt=%u, channel=%u\r\n",
     toString(c->McpsRequest), toString(c->Status), c->Datarate, c->TxPower,
     c->AckReceived,
    #if (defined( LORAMAC_VERSION ) && ( LORAMAC_VERSION == 0x01000300 ))
      "retries", c->NbRetries,
    #elif (defined( LORAMAC_VERSION ) && ( LORAMAC_VERSION == 0x01000400 ))
      "trans", c->NbTrans,
    #endif /* LORAMAC_VERSION */
    (unsigned)c->TxTimeOnAir, (unsigned)c->UpLinkCounter, (unsigned)c->Channel);
  instance->last_tx_acked = c->AckReceived;
  instance->fcnt_up = c->UpLinkCounter;
}

void STM32LoRaWAN::MacMcpsIndication(McpsIndication_t* i, LoRaMacRxStatus_t* status) {
  // Called on Mcps event (data received or rx aborted), after McpsConfirm
  core_debug(
    "McpsIndication: ind=%s, status=%s, multicast=%u, port=%u, datarate=%u, pending=%u, size=%u, rxdata=%u, ack=%u, dncnt=%u, devaddr=%08x, rssi=%d, snr=%d, slot=%u\r\n",
    toString(i->McpsIndication), toString(i->Status), i->Multicast, i->Port,
    i->RxDatarate, i->IsUplinkTxPending, i->BufferSize, i->RxData,
    i->AckReceived, i->DownLinkCounter, i->DevAddress,
    status->Rssi, status->Snr, status->RxSlot);

  instance->fcnt_down = i->DownLinkCounter;

  if ((i->McpsIndication == MCPS_CONFIRMED || i->McpsIndication == MCPS_UNCONFIRMED) && i->Status == LORAMAC_EVENT_INFO_STATUS_OK) {
    instance->add_rx(i->Buffer, i->BufferSize);
    instance->rx_port = i->Port;
    instance->rx_rssi = status->Rssi;
    instance->rx_snr = status->Snr;
  }
}

void STM32LoRaWAN::MacMlmeConfirm(MlmeConfirm_t* c) {
  // Called when a Mlme request is completed (e.g. join complete or
  // failed, link check answer received, etc.)
  core_debug(
    "MlmeConfirm: req=%s, status=%s, airtime=%u, margin=%u, gateways=%u\r\n",
     toString(c->MlmeRequest), toString(c->Status), c->TxTimeOnAir, c->DemodMargin, c->NbGateways);
}

void STM32LoRaWAN::MacMlmeIndication(MlmeIndication_t* i, LoRaMacRxStatus_t* status) {
  // Called on join accept (and some class B events), after MlmeConfirm
  core_debug(
    "MlmeIndication: ind=%s, status=%s, datarate=%u, dncnt=%u, rssi=%d, snr=%d, slot=%u\r\n",
    toString(i->MlmeIndication), toString(i->Status),
    i->RxDatarate, i->DownLinkCounter,
    status->Rssi, status->Snr, status->RxSlot);
}
